//
//  Global.swift
//  schedule
//
//  Created by TimeCity on 2019/11/21.
//  Copyright © 2019 TimeCity. All rights reserved.
//

import Foundation
import FirebaseStorage
import Reachability

let US = Share.shared

let UD = UserDefaults.standard

let screenWidth = UIScreen.main.bounds.width
let screenHeight = UIScreen.main.bounds.height
let screenOrigin = UIScreen.main.bounds.origin

let totalDic = ["性別":["公","母"],"類型":["貓","狗"],"體型":["大型","中型","小型"],"地區":["臺北","新北","桃園","新竹","苗栗","臺中","彰化","雲林","嘉義","臺南","高雄","屏東","花蓮","臺東","澎湖","金門","基隆","宜蘭"],"年紀":["幼年","成年"],"絕育":["是","否","未知"],"拾獲時間":["三天","一週","一月","半年"]]

let shelterData = [("北部",["新北市政府動物保護防疫處","新北市板橋區公立動物之家","新北市新店區公立動物之家","新北市中和區公立動物之家","新北市淡水區公立動物之家","新北市瑞芳區公立動物之家","新北市五股區公立動物之家","新北市八里區公立動物之家","新北市三芝區公立動物之家","臺北市動物之家","桃園市動物保護教育園區","宜蘭縣流浪動物中途之家","新竹縣公立動物收容所","新竹市動物保護教育園區","基隆市寵物銀行"]), ("中部",["臺中市動物之家南屯園區","臺中市動物之家后里園區","苗栗縣生態保育教育中心(動物收容所)","彰化縣流浪狗中途之家","南投縣公立動物收容所"]), ("南部",["臺南市動物之家灣裡站","臺南市動物之家善化站","高雄市壽山動物保護教育園區","高雄市燕巢動物保護關愛園區","嘉義縣流浪犬中途之家","屏東縣公立犬貓中途之家","嘉義市動物保護教育園區"]), ("其他",["臺東縣動物收容中心","花蓮縣流浪犬中途之家","澎湖縣流浪動物收容中心","金門縣動物收容中心"])]

let shelterAddressDic = ["新北市政府動物保護防疫處":"新北市板橋區四川路一段157巷2號","新北市板橋區公立動物之家":"新北市板橋區板城路28-1號","新北市新店區公立動物之家":"新北市新店區安泰路231號","新北市中和區公立動物之家":"新北市中和區興南路三段100號","新北市淡水區公立動物之家":"新北市淡水區下圭柔山91-3號","新北市瑞芳區公立動物之家":"新北市瑞芳區靜安路四段","新北市五股區公立動物之家":"新北市五股區外寮路9-9號","新北市八里區公立動物之家":"新北市八里區長道路249號","新北市三芝區公立動物之家":"新北市三芝區青山路","臺北市動物之家":"台北市內湖區潭美街852號","桃園市動物保護教育園區":"桃園市新屋區藻礁路1668號","宜蘭縣流浪動物中途之家":"宜蘭縣五結鄉利寶路60號","新竹縣公立動物收容所":"新竹縣竹北市縣政五街192號","新竹市動物保護教育園區":"新竹市南寮里海濱路250號","基隆市寵物銀行":"基隆市信義區信二路241號1樓","臺中市動物之家南屯園區":"臺中市南屯區中台路601號","臺中市動物之家后里園區":"臺中市后里區堤防路370號","苗栗縣生態保育教育中心(動物收容所)":"苗栗縣銅鑼鄉朝陽村6鄰朝北55-1號","彰化縣流浪狗中途之家":"彰化縣員林市大峰里阿寶巷426號","南投縣公立動物收容所":"南投縣南投市嶺興路36-1號","臺南市動物之家灣裡站":"臺南市南區省躬里14鄰萬年路580巷92號","臺南市動物之家善化站":"臺南市善化區昌隆里東勢寮1-19號","高雄市壽山動物保護教育園區":"高雄市鼓山區萬壽路350號","高雄市燕巢動物保護關愛園區":"高雄市燕巢區師大路98號","嘉義縣流浪犬中途之家":"嘉義縣大林鎮中坑里中興2-6號","屏東縣公立犬貓中途之家":"屏東縣內埔鄉學府路1號","嘉義市動物保護教育園區":"嘉義市彌陀路31號","臺東縣動物收容中心":"台東市中興路二段733號","花蓮縣流浪犬中途之家":"花蓮縣吉安鄉南濱路一段599號","澎湖縣流浪動物收容中心":"澎湖縣馬公市880260號","金門縣動物收容中心":"金門縣金湖鎮裕民農莊20號"]

let defultColor : UIColor = UIColor.init(red: 211/255, green: 255/255, blue: 230/255, alpha: 1)
let UPD = "updateDate"

var reachability = Reachability()

var chooseArr = [""]

var userDisplayName = ""

let BundleVersion = "1.3"

let tabBarVC = UITabBarController()
let tabbarHeight = tabBarVC.tabBar.frame.size.height

var navigationHeight = CGFloat()

let statusHeight = UIApplication.shared.statusBarFrame.size.height
